In [8]:
# EDA

In [9]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot  as plt

In [10]:
df=pd.read_csv('Churn_Modelling.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [12]:
print(df.isnull().sum())

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [13]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [16]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [17]:
import pandas as pd
import numpy as np

# Create sample data
data = {
    "Name": ["Ali", "Ahmed", "Sara", "Ayesha", None],
    "Age": [25, 30, None, 28, 22],
    "Salary": [50000, None, 45000, 48000, 52000]
}

df = pd.DataFrame(data)

print(df)

     Name   Age   Salary
0     Ali  25.0  50000.0
1   Ahmed  30.0      NaN
2    Sara   NaN  45000.0
3  Ayesha  28.0  48000.0
4    None  22.0  52000.0

In [18]:
print(df.isnull())        # Shows True/False
print(df.isnull().sum())  # Count missing values

    Name    Age  Salary
0  False  False   False
1  False  False    True
2  False   True   False
3  False  False   False
4   True  False   False
Name      1
Age       1
Salary    1
dtype: int64

In [19]:
df_dropped = df.dropna()
print(df_dropped)

     Name   Age   Salary
0     Ali  25.0  50000.0
3  Ayesha  28.0  48000.0

In [20]:
df_dropped_col = df.dropna(axis=1)
print(df_dropped_col)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [21]:
df

     Name   Age   Salary
0     Ali  25.0  50000.0
1   Ahmed  30.0      NaN
2    Sara   NaN  45000.0
3  Ayesha  28.0  48000.0
4    None  22.0  52000.0

In [22]:
df["Age"].fillna(df["Age"].mean(), inplace=True)
df["Salary"].fillna(df["Salary"].mean(), inplace=True)

In [23]:
df

     Name    Age   Salary
0     Ali  25.00  50000.0
1   Ahmed  30.00  48750.0
2    Sara  26.25  45000.0
3  Ayesha  28.00  48000.0
4    None  22.00  52000.0

In [24]:
df["Age"].fillna(df["Age"].median(), inplace=True)

In [25]:
print(df.isnull().sum())

Name      1
Age       0
Salary    0
dtype: int64

In [ ]:
df.fillna("Unknown", inplace=True)

In [31]:
df

      Name    Age   Salary
0      Ali  25.00  50000.0
1    Ahmed  30.00  48750.0
2     Sara  26.25  45000.0
3   Ayesha  28.00  48000.0
4  Unknown  22.00  52000.0

In [32]:
print(df.isnull().sum())

Name      0
Age       0
Salary    0
dtype: int64

In [ ]:
# here is feature scalling 

from sklearn.preprocessing import MinMaxScaler
import pandas as pd

data = pd.DataFrame({
    "Age": [25, 30, 35],
    "Salary": [50000, 60000, 70000]
})

scaler = MinMaxScaler()
scaled_data = scaler.fit_transform(data)

print(scaled_data)

[[0.  0. ]
 [0.5 0.5]
 [1.  1. ]]

In [34]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
scaled_data = scaler.fit_transform(data)

print(scaled_data)

[[-1.22474487 -1.22474487]
 [ 0.          0.        ]
 [ 1.22474487  1.22474487]]

In [ ]:
# feature scalling

import numpy as np
import pandas as pd 
import matplotlib.pyplot  as plt

In [36]:
df=pd.read_csv('Churn_Modelling.csv')
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [39]:
new_df=pd.DataFrame(df,columns=['Age','Tenure'])

In [41]:
new_df.head(5)

   Age  Tenure
0   42       2
1   41       1
2   42       8
3   39       1
4   43       2